# SC12x

## 데이터 탐색 및 가설 검정

이번 SC 에서 여러분은 가상의 마케팅 데이터를 활용한 통계 분석을 진행하시게 됩니다. 

## 데이터셋 정보 :   
이 데이터셋은 알뜰 구매를 도와주는 XYZ사의 마케팅 정보를 다룹니다. 개인 정보는 보호를 위해 제거 되어 있습니다.

**Attribute Information:**
> 2,240 customers of XYZ company:

- ID - 고객의 고유값
- Year_Birth - 고객의 출생연도
- Education - 고객의 최종학력
- Marital_Status - 고객의 혼인여부
- Income - 고객의 연간 수입
- Kidhome - 자녀가 미취학아동인지 여부 (1 - yes, 0 - no)
- Teenhome - 자녀가 10대 청소년인지 여부 (1 - yes, 0 - no)
- Dt_Customer - 서비스 가입 시기
- Recency - 마지막 구매 시기 (일)
- MntWines - 최근 2년간 구매한 와인 구매 총액
- MntFruits- 최근 2년간 구매한 과일 구매 총액
- MntMeatProducts - 최근 2년간 구매한 정육 구매 총액
- MntFishProducts - 최근 2년간 구매한 어류 구매 총액
- MntSweetProducts - 최근 2년간 구매한 과자 구매 총액
- MntGoldProds - 최근 2년간 구매한 황금 구매 총액
- NumDealsPurchases - 할인을 통해 제품을 구매한 횟수
- NumWebPurchases - 회사의 웹사이트를 통해 구매한 횟수
- NumStorePurchases - 가게에서 직접 구매한 횟수
- NumWebVisitsMonth - 회사의 웹사이트를 방문한 횟수
- Complain - 고객의 최근 2년간 회사에 대한 클레임 여부 (1 - yes, 0 - no)
- Country - 고객의 국적

## Part 1 - 데이터 불러오기

### 1) 데이터셋을 업로드합니다

In [117]:
# 과제 1 : 데이터 불러오기
import pandas as pd
data = 'sc12x_dataset.csv'
df = pd.read_csv(data,encoding='cp949')
df

      Unnamed: 0     ID  ...  NumWebVisitsMonth Complain
0              0   1826  ...                  1        0
1              1      1  ...                  5        0
2              2  10476  ...                  2        0
3              3   1386  ...                  7        0
4              4   5371  ...                  7        0
...          ...    ...  ...                ...      ...
2235        2235  10142  ...                  4        0
2236        2236   5263  ...                  8        0
2237        2237     22  ...                  8        0
2238        2238    528  ...                  3        0
2239        2239   4070  ...                  7        0

[2240 rows x 22 columns]

### 2) 결측치가 있는지 확인한 후 있다면 제거하세요

In [110]:
# 과제 2 - 1 : 결측치 확인
df.isnull().sum()

Unnamed: 0            0
ID                    0
Year_Birth            0
Country               0
Education             0
Marital_Status        0
 Income              24
Kidhome               0
Teenhome              0
Dt_Customer           0
Recency               0
MntWines              0
MntFruits             0
MntMeatProducts       0
MntFishProducts       0
MntSweetProducts      0
MntGoldProds          0
NumDealsPurchases     0
NumWebPurchases       0
NumStorePurchases     0
NumWebVisitsMonth     0
Complain              0
dtype: int64

In [111]:
# 과제 2 - 2 : 결측치 제거
df.fillna(0, inplace=True)

### 3) 아래의 특성들을 만드세요

1. **TotalMntProducts** - 최근 2년간 구매한 모든 제품 가격들을 합한 값을 가진 계산한 특성입니다

2. **TotalNumPurchases** - 구매횟수를 모두 합친 값을 가진 특성입니다

3. **DaysSinceJoined** - 오늘 날짜를 기준으로 가입한 기간을 보여주는 특성입니다 

4. **VIP** - 누적 구매 금액이 $2,000 이상을 넘고, 오늘을 기준으로 가입기간이 5년 이상이 된다면 1, 아니면 0의 값을 가진 칼럼을 만듭니다

In [112]:
# 과제 3 - 1 : Feature 추가 / TotalMntProducts
df['TotalMntProducts'] = df['MntMeatProducts'] + df['MntFishProducts'] + df['MntSweetProducts'] + df['MntGoldProds']
df['TotalMntProducts']

0        897
1        108
2        106
3          1
4         69
        ...
2235     299
2236      40
2237     122
2238    1078
2239     885
Name: TotalMntProducts, Length: 2240, dtype: int64

In [113]:
# 과제 3 - 2 : Feature 추가 / TotalNumPurchases
df['TotalNumPurchases'] = df['NumDealsPurchases'] + df['NumWebPurchases'] + df['NumStorePurchases']
df['TotalNumPurchases']

0       11
1       15
2        9
3        4
4        7
        ..
2235    18
2236     5
2237    13
2238    16
2239    13
Name: TotalNumPurchases, Length: 2240, dtype: int64

In [114]:
# 과제 3 - 3 : Feature 추가 / DaysSinceJoined
# 날짜 분리해주는 함수 필요.. 가 아니라 날짜형식이 있었네.
from datetime import datetime
def daytime(input):
  date = datetime.strptime(input, '%m/%d/%y')
  result = datetime.now() - date
  result = str(result).split()
  return result[0]

df['DaysSinceJoined'] = df['Dt_Customer'].apply(daytime)
df['DaysSinceJoined']

0       2660
1       2661
2       2694
3       2696
4       2729
        ...
2235    3126
2236    3170
2237    3220
2238    3224
2239    3313
Name: DaysSinceJoined, Length: 2240, dtype: object

In [144]:
df

      Unnamed: 0     ID  Year_Birth  ... NumWebVisitsMonth Complain Income
0              0   1826        1970  ...                 1        0  84835
1              1      1        1961  ...                 5        0  57091
2              2  10476        1958  ...                 2        0  67267
3              3   1386        1967  ...                 7        0  32474
4              4   5371        1989  ...                 7        0  21474
...          ...    ...         ...  ...               ...      ...    ...
2235        2235  10142        1976  ...                 4        0  66476
2236        2236   5263        1977  ...                 8        0  31056
2237        2237     22        1976  ...                 8        0  46310
2238        2238    528        1978  ...                 3        0  65819
2239        2239   4070        1969  ...                 7        0  94871

[2240 rows x 23 columns]

In [142]:
df.columns

Index(['Unnamed: 0', 'ID', 'Year_Birth', 'Country', 'Education',
       'Marital_Status', ' Income ', 'Kidhome', 'Teenhome', 'Dt_Customer',
       'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts',
       'MntFishProducts', 'MntSweetProducts', 'MntGoldProds',
       'NumDealsPurchases', 'NumWebPurchases', 'NumStorePurchases',
       'NumWebVisitsMonth', 'Complain', 'Income'],
      dtype='object')

## Part 2 - 가설 검정

### Hypothesis Test    
   - 수치형 (numerical/continuous) 칼럼이 어떤 차이를 보이는지 t-test를 통해 가설을 세우고 검증하세요. (최소 2개)
   - 범주형 (categorical) 칼럼이 어떤 차이를 보이는지 $\chi^2-test$를 통해 가설을 세우고 검증하세요. (최소 2개)  
  **Hint:** categorical feature 간의 "cross tab"을 생성하여 탐색해 보세요 (aka [contingency tables](https://en.wikipedia.org/wiki/Contingency_table)). 그리고 $\chi^2 test$를 적용해 보세요. [pandas.crosstab](http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html)을 사용하면 contingency table 을 생성할 수 있습니다. 그리고 [scipy.stats.chi2_contingency](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.chi2_contingency.html)를 사용하면 $\chi^2$ statistics 를 계산할 수 있습니다.

In [188]:
# 과제 2 - 1 - 1: 수치형 칼럼 t-test 시행 (정육 - 어류)

import scipy.stats
import numpy as np
m = []

for i in range(10):
  val1 = df.MntMeatProducts.sample(n=30,replace=True)
  val2 = df.MntFishProducts.sample(n=30,replace=True)
  value = scipy.stats.ttest_rel(val1, val2)
  m.append(value[1])
  #print(value[1])

print('P-value :',np.mean(m))

P-value : 0.012252001884517619

In [191]:
# 과제 2 - 1 - 2: 수치형 칼럼 t-test 시행 (온라인 스토어 구매 - 오프라인 스토어 구매)
m = []

for i in range(10):
  val1 = df.NumWebPurchases.sample(n=30,replace=True)
  val2 = df.NumStorePurchases.sample(n=30,replace=True)
  value = scipy.stats.ttest_rel(val1, val2)
  m.append(value[1])
  #print(value[1])

print('P-value :',np.mean(m))

P-value : 0.057152322306418056

In [180]:
# 과제 2 - 2 - 1 : 범주형 칼럼  카이스퀘어 검정 시행 (교육수준 - 결혼상태)
import pandas as pd
from scipy.stats import chi2_contingency

df1 = pd.crosstab(df.Education,df.Marital_Status)
chiresult = chi2_contingency(df1, correction=False)
print('Chi square: {}'.format(chiresult[0]))
print('P-value: {}'.format(chiresult[1]))
print('Degrees of freedom: {}'.format(chiresult[2]))
df1

Chi square: 27.28808951783786
P-value: 0.5026041781229574
Degrees of freedom: 28

Marital_Status  Absurd  Alone  Divorced  Married  Single  Together  Widow  YOLO
Education
2n Cycle             0      0        23       81      37        57      5     0
Basic                0      0         1       20      18        14      1     0
Graduation           1      1       119      433     252       286     35     0
Master               1      1        37      138      75       106     12     0
PhD                  0      1        52      192      98       117     24     2

In [179]:
# 과제 2 - 2 - 2 : 범주형 칼럼  카이스퀘어 검정 시행 (국가 - 교육수준)

df2 = pd.crosstab(df.Country,df.Education)
chiresult = chi2_contingency(df2, correction=False)
print('Chi square: {}'.format(chiresult[0]))
print('P-value: {}'.format(chiresult[1]))
print('Degrees of freedom: {}'.format(chiresult[2]))
df2

Chi square: 31.295081569876153
P-value: 0.3041344587983141
Degrees of freedom: 28

Education  2n Cycle  Basic  Graduation  Master  PhD
Country
AUS               9      4          85      32   30
CA               24      7         133      49   55
GER              20      2          59      20   19
IND              21      4          76      21   26
ME                0      0           1       1    1
SA               25      6         161      60   85
SP               97     28         548     171  251
US                7      3          64      16   19

## Part 3 - Analysis and Interpretation

자, 위 파트들에서 우리는 데이터들을 잘 관찰했습니다. 다음의 질문들에 텍스트로 답변하십시오.  

1) 여러분들이 수행한 두 개 이상의 t-test 들을 해석하고 설명해 보세요.
2) 여러분들이 수행한 두 개 이상의 $\chi^2$ test 들을 해석하고 설명해 보세요.



1.   t-test 해석
    1. 정육 - 어류 분석
      - H0 = 정육 과 어류 간 평균 차이는 없을 것이다.
      - H1 = 정육 과 어류 간 평균 차이가 있을 것이다.
      - P-value < 0.05 이므로 H0 기각 =  정육 판매량에 따른 어류 판매량의 차이는 있다.

    2. 온라인 스토어 판매 - 오프라인 스토어 판매 분석
      - H0 = 온라인 과 오프라인 간 평균 차이는 없을 것이다.
      - H1 = 온라인 과 오프라인 간 평균 차이가 있을 것이다.
      - P-value > 0.05 이므로 H0를 기각할 수 없다. =  온라인과 판매량에 따른 오프라인 판매량의 차이는 없다.


2.   χ2  test 해석

    1. 교육수준 - 결혼상태 분석
      - H1 = 교육수준과 결혼상태는 연관관계가 있을 것이다.
      - h0 = 교육수준과 결혼상태는 연관관계가 없다.
      - P-value > 0.05 이므로 H0 기각 실패 =  교육수준과 결혼상태 사이의 관계는 없다고 결론
      
    2. 국가 - 교육수준 분석
      - H1 = 국가와 교육수준은 연관관계가 있을 것이다.
      - H0 = 국가와 교육수준은 연관관계가 없다.
      - P-value > 0.05 이므로 H0 기각 실패 = 국가와 교육수준은 독립적이라고 결론

# Advanced Goals: 
> SC 에서 3점을 얻고 싶으시다면 아래의 문제를 모두 풀어주세요. 다만 2점을 얻었다면 충분합니다. 시간과 여유가 있는 분들만 도전해 보시기 바랍니다. 

## Part 1: 

여러분들의 dataframe column들이 적절한 data type을 가지도록 작업해 보세요.   
**Hint:** 특정 column datatype 이 float 이나 integer 로 되어있음에도 불구하고 "object" 라고 되어 있는 경우가 있습니다. 이 경우, `pd.to_numeric()`, `pd.to_datetime()` 과 같은 방법으로 칼럼들을 변환해 보세요. 
주석을 통해 읽는 이가 쉽게 읽을 수 있고, 전체 내용을 쉽게 따라갈 수 있다면 3점을 얻을 수 있습니다. 

## Part 2:

데이터 셋의 적절한 column들의 조합으로 $t-test$와 $\chi^2 test$가 쉽게 수행될 수 있도록 함수를 작성해 보세요.
**데이터 타입에 알맞은 가설검정이 실행되야 하는 것을 잊지 마세요**

## Part 3: 
평균 추정치에 대한 신뢰 구간(confidence interval)을 계산하고 결과를 작성하세요 (최소 두 개 선택). 계산한 추정치가 얼마나 정확한지 시각적으로 확인할 수 있도록 matplotlib, seaborn 등의 시각화 라이브러리를 활용해서 나타내세요

In [ ]:
# 각 파트가 잘 구분되어질 수 있도록 해 주세요

In [ ]:
### 이곳에 Part 1 답안을 작성해주시기 바랍니다

In [ ]:
### 이곳에 Part 2 답안을 작성해주시기 바랍니다

In [ ]:
### 이곳에 Part 3 답안을 작성해주시기 바랍니다

In [ ]:
# 과제 2 - 1 : 수치형 칼럼 t-test 시행 (income - sweet)
# 1. Income 데이터 수치화 (object -> int / float)
def column_cleaning(col):
  temp_list = []  # 빈 리스트 준비

  for i in col:
    try:
      temp = i.replace(",", "")
      temp = temp.replace("$", "")
      temp = temp.replace(".", "")
      temp = temp[0:-3]
      temp = int(temp)
    except:
      #temp = 0  # 0으로 결측치 처리(불용)
      a = 0
    temp_list.append(temp)

  return temp_list 

df['Income'] = column_cleaning(df[' Income '])
a = int(df['Income'].mean()) #Income 평균값
df['Income'].fillna(a) # 으로 결측치 처리

# 2. T-test : 소득과 달달함은 관련이 있다
from scipy import stats
inc = df.Income
swt = df.MntSweetProducts
pv1 = stats.ttest_ind(inc,swt,equal_var=True).pvalue
pv1